Tekla.Structures.Model.UI.SnapshotSettings


Tekla.Structures.Model.UI.SnapshotSettings.DPI
The image DPI; default value is 72

Tekla.Structures.Model.UI.SnapshotSettings.Width
The image width; if not specified the original width will be used;
if both height and width are set, we keep the height and we adjust the width to match the original view scale

Tekla.Structures.Model.UI.SnapshotSettings.Height
The image height; if not specified the original width will be used
if both height and width are set, we keep the height and we adjust the width to match the original view scale

Tekla.Structures.Model.UI.SnapshotSettings.UseSmoothLines
Option to use smooth lines; 1 to use smooth lines, 0 otherwise; default value is 0

Tekla.Structures.Model.UI.SnapshotSettings.LineWidth
The line width; default value is 1

Tekla.Structures.Model.UI.SnapshotSettings.WhiteBG
Option to make the background white; 1 for using white background, 0 for using the original background; default value is 0